In [1]:
import pandas as pd

In [3]:
veri = pd.DataFrame({"a":["bir","iki"]*3,"b":[1,1,2,3,2,3]})
veri

     a  b
0  bir  1
1  iki  1
2  bir  2
3  iki  3
4  bir  2
5  iki  3

In [4]:
veri.duplicated()
# tekrar edilenleri true yapar 
# bir iki false çünkü ilk bu yazıldı tekrar yok
# bir iki true çünkü üsttekini tekrar etti

0    False
1    False
2    False
3    False
4     True
5     True
dtype: bool

In [6]:
veri.drop_duplicates()
# tekrar eden satırları kaldırır

     a  b
0  bir  1
1  iki  1
2  bir  2
3  iki  3

In [8]:
veri["c"]=range(6)
# veriye c sütunu ekledik
# bu sütunun satırları da 0 dan 6 ya kadar sayılar

In [9]:
veri

     a  b  c
0  bir  1  0
1  iki  1  1
2  bir  2  2
3  iki  3  3
4  bir  2  4
5  iki  3  5

In [10]:
veri.duplicated(["a"])
# sadece a sütunu için tekrar eden var mı bakar

0    False
1    False
2     True
3     True
4     True
5     True
dtype: bool

In [11]:
veri.duplicated(["a","b"])
# bir iki false
# bir bir false
# bir iki true
# bir bir true
# her iki sütunun da aynı olması lazım kesişim gibi düşün

0    False
1    False
2    False
3    False
4     True
5     True
dtype: bool

In [13]:
veri.duplicated("a",keep = "last")
# bu sefer alttakilere true değil üsttekilere true dedi
# çünkü sondan kontrol etmeye başladı

0     True
1     True
2     True
3     True
4    False
5    False
dtype: bool

In [14]:
vs = pd.DataFrame({"isim":["Ali","can","Nur","Efe","ata"],
                "puan":[60,50,70,80,40]})
vs

  isim  puan
0  Ali    60
1  can    50
2  Nur    70
3  Efe    80
4  ata    40

In [15]:
sinif={"Ali":"A","Can":"A","Nur":"B","Efe":"B","Ata":"B"}

In [17]:
ad=vs["isim"].str.capitalize()
# tablodaki isimlerin baş harflerini bğyğk kabul etti

In [19]:
vs["sube"]=ad.map(sinif)
#  Bu satırda, map() fonksiyonu kullanılarak bir sütun oluşturulmaktadır.
# Burada map() fonksiyonu, bir sütunu dönüştürmek veya yeni bir sütun oluşturmak için kullanılır.
# Örneğin, ad adında bir Seri veya sütununuz varsa ve bu sütun, öğrenci adlarını içeriyorsa,
# sinif adında bir sözlüğünüz varsa ve bu sözlük öğrenci adlarını sınıflara eşleştiriyorsa,
# bu kod öğrencilerin sınıflarını içeren yeni bir "sube" sütunu oluşturacaktır.

In [20]:
vs

  isim  puan sube
0  Ali    60    A
1  can    50    A
2  Nur    70    B
3  Efe    80    B
4  ata    40    B

In [21]:
nt = pd.Series([80,70,90,60])

In [22]:
nt

0    80
1    70
2    90
3    60
dtype: int64

In [23]:
import numpy as np

In [24]:
nt.replace(70,np.nan)
# 70 i eksik veri yaptık

0    80.0
1     NaN
2    90.0
3    60.0
dtype: float64

In [25]:
nt.replace([70,60],[np.nan,0])
# 60 sıfır 70 eksik veri oldu

0    80.0
1     NaN
2    90.0
3     0.0
dtype: float64

In [26]:
nt.replace({90:100,80:50})
# 90 100 , 80 50 oldu

0     50
1     70
2    100
3     60
dtype: int64

In [37]:
df = pd.DataFrame(np.arange(12).reshape(3,4),
                  index = [0,1,2],
                  columns=["ali","efe","eda","can"])
df

   ali  efe  eda  can
0    0    1    2    3
1    4    5    6    7
2    8    9   10   11

In [38]:
s = pd.Series(["one","two","three"])
df.index=df.index.map(s)
# map dönüşüm işlemini gerçekleştirir

In [39]:
df

       ali  efe  eda  can
one      0    1    2    3
two      4    5    6    7
three    8    9   10   11

In [40]:
df.rename(index=str.title,columns=str.upper)
# rename metodu ile büyüttük

       ALI  EFE  EDA  CAN
One      0    1    2    3
Two      4    5    6    7
Three    8    9   10   11

In [41]:
df.rename(index={"one":"zero"},columns={"can":"ata"})
# rename metodu ile değiştirdik
# ama bunların kalıcı değildir df yazınca tekrar ilk haline döner

       ali  efe  eda  ata
zero     0    1    2    3
two      4    5    6    7
three    8    9   10   11

In [42]:
df

       ali  efe  eda  can
one      0    1    2    3
two      4    5    6    7
three    8    9   10   11

In [43]:
df.rename(index={"one":"zero"},columns={"can":"ata"},
         inplace=True)
# inplace = true metodu ile kalıcı hale getirdik

In [44]:
df

       ali  efe  eda  ata
zero     0    1    2    3
two      4    5    6    7
three    8    9   10   11

In [46]:
nt=[30,40,80,90,60,45,95,75,55,100,65,85]

In [47]:
aralik=[20,40,60,80,100]

In [48]:
puan = pd.cut(nt,aralik)
# cut metodu ile nt deki puanları araliktaki araliklara göre ayırdık

In [49]:
puan

[(20, 40], (20, 40], (60, 80], (80, 100], (40, 60], ..., (60, 80], (40, 60], (80, 100], (60, 80], (80, 100]]
Length: 12
Categories (4, interval[int64, right]): [(20, 40] < (40, 60] < (60, 80] < (80, 100]]

In [50]:
puan.codes
# 20-40 aralığına 0 verdi ve puanların denk geldiği aralıkları aşağıdaki gibi gösterdi

array([0, 0, 2, 3, 1, 1, 3, 2, 1, 3, 2, 3], dtype=int8)

In [51]:
puan.categories
# puan kategorilerini gösteriyor

IntervalIndex([(20, 40], (40, 60], (60, 80], (80, 100]], dtype='interval[int64, right]')

In [52]:
pd.value_counts(puan)
# hangi aralıkta kaç tane veri var bunları göstermekte

C:\Users\ibrahim\AppData\Local\Temp\ipykernel_32828\2710804226.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(puan)

(80, 100]    4
(40, 60]     3
(60, 80]     3
(20, 40]     2
Name: count, dtype: int64

In [ ]:
# Bu FutureWarning mesajı, pandas.value_counts fonksiyonunun gelecekteki sürümlerde kaldırılacağını
# ve yerine pd.Series(obj).value_counts() kullanılması gerektiğini belirtmektedir.
# Bu uyarı, kodunuzun gelecekteki pandas sürümlerinde çalışmayabileceğini belirtir.

In [53]:
puan=pd.cut(nt,aralik,right=False)
# right=False metodu açık parantezleri köşeli hale getirir

In [55]:
puan

[[20, 40), [40, 60), [80, 100), [80, 100), [60, 80), ..., [60.0, 80.0), [40.0, 60.0), NaN, [60.0, 80.0), [80.0, 100.0)]
Length: 12
Categories (4, interval[int64, left]): [[20, 40) < [40, 60) < [60, 80) < [80, 100)]

In [56]:
isim = ["düşük","orta","yüksek","tavan"]
pd.cut(nt,aralik,labels=isim)
# aralıkları derecelendirdik labels ile

['düşük', 'düşük', 'yüksek', 'tavan', 'orta', ..., 'yüksek', 'orta', 'tavan', 'yüksek', 'tavan']
Length: 12
Categories (4, object): ['düşük' < 'orta' < 'yüksek' < 'tavan']

In [57]:
pd.cut(nt,10)
# 10 aralığa böldük puanlarımıza göre tabiki

[(29.93, 37.0], (37.0, 44.0], (79.0, 86.0], (86.0, 93.0], (58.0, 65.0], ..., (72.0, 79.0], (51.0, 58.0], (93.0, 100.0], (58.0, 65.0], (79.0, 86.0]]
Length: 12
Categories (10, interval[float64, right]): [(29.93, 37.0] < (37.0, 44.0] < (44.0, 51.0] < (51.0, 58.0] ... (72.0, 79.0] < (79.0, 86.0] < (86.0, 93.0] < (93.0, 100.0]]

In [58]:
veri=np.random.randn(100)
# 100 birimlik veri oluşturdk

In [59]:
x = pd.qcut(veri,4)
# qcut ile veriyi çeyrek aralığa böldük

In [60]:
x

[(0.438, 3.461], (-0.554, -0.221], (-0.554, -0.221], (-0.554, -0.221], (0.438, 3.461], ..., (-0.554, -0.221], (-0.554, -0.221], (0.438, 3.461], (0.438, 3.461], (-0.554, -0.221]]
Length: 100
Categories (4, interval[float64, right]): [(-2.314, -0.554] < (-0.554, -0.221] < (-0.221, 0.438] < (0.438, 3.461]]

In [62]:
pd.value_counts(x)

C:\Users\ibrahim\AppData\Local\Temp\ipykernel_32828\9629735.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(x)

(-2.314, -0.554]    25
(-0.554, -0.221]    25
(-0.221, 0.438]     25
(0.438, 3.461]      25
Name: count, dtype: int64

In [63]:
veri = pd.DataFrame(np.random.randn(1000,4))

In [64]:
veri.head()

          0         1         2         3
0 -0.624046  1.050763  0.139462 -0.571542
1 -0.741324  0.147345 -0.134668 -0.862450
2 -1.262713  0.466461 -0.565358 -1.425430
3 -1.581735  1.169169 -0.177858  0.636886
4  0.605252  0.743487 -0.973309  0.360379

In [65]:
veri.describe()
# sütunların özetleri

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.017465    -0.034943    -0.077506    -0.050517
std       0.975099     0.988319     0.996654     1.013615
min      -2.856982    -3.448274    -3.195327    -3.136838
25%      -0.676381    -0.692180    -0.737345    -0.775477
50%       0.010421    -0.065202    -0.071017    -0.051507
75%       0.604802     0.607703     0.596503     0.605818
max       3.435593     3.248040     3.119698     3.192815

In [66]:
sutun=veri[1]
# verinin 1.sütununu sutun diye aldık sadece orayı çalıştıracağız

In [67]:
sutun[np.abs(sutun)>3]
# abs özel mutlak değer matematikde
# mutlak değeri > 3 olanların sayısını yazdır dedik

252   -3.448274
645    3.248040
Name: 1, dtype: float64

In [71]:
veri[(np.abs(veri)>3).any(axis=1)]
# Bu kod, DataFrame'deki herhangi bir satırda mutlak değeri 3'ten büyük olan bir değere sahip olan satırları seçer

            0         1         2         3
162 -1.392680 -1.163059 -0.840694  3.068318
216  0.387263 -1.831919 -0.160231 -3.136838
252 -0.307301 -3.448274 -0.311119 -0.252325
514 -1.378906 -0.343923 -3.195327  0.370757
645  1.953436  3.248040 -0.698326 -1.102540
647  3.435593 -1.315049  0.161687 -0.774935
703  0.877411  0.139463  3.119698  1.150220
900  0.245195 -0.419509 -0.653807  3.192815

In [72]:
np.sign(veri).head()
# -1 negatifleri +1 pozitifleri temsil eder

     0    1    2    3
0 -1.0  1.0  1.0 -1.0
1 -1.0  1.0 -1.0 -1.0
2 -1.0  1.0 -1.0 -1.0
3 -1.0  1.0 -1.0  1.0
4  1.0  1.0 -1.0  1.0

In [73]:
veri=pd.DataFrame(np.arange(12).reshape(4,3))
veri

   0   1   2
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

In [74]:
sira=np.random.permutation(4)
sira
# permutation metodu random ile entegre olup rastgele 4 e kadar bir dizi oluşturdu

array([1, 0, 3, 2])

In [76]:
veri.take(sira)
# sirayı tabloya rastgele dağıttı tablo düzeni değişti

   0   1   2
1  3   4   5
0  0   1   2
3  9  10  11
2  6   7   8

In [83]:
veri.sample()
# rastgele satır seçtik

   0   1   2
3  9  10  11

In [84]:
veri.sample(n=2)
# rastgele 2 satır seçilir

   0   1   2
3  9  10  11
1  3   4   5

In [85]:
veri=pd.DataFrame({"harf":["c","b","a","b","b","a"],
                   "sayi":range(6)})
veri

  harf  sayi
0    c     0
1    b     1
2    a     2
3    b     3
4    b     4
5    a     5